---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TypeWallClosure
source: html/9f292110-58da-0781-5581-da6fb78f5e3f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TypeWallClosure Property

"Wall Closure"

## Syntax (C#)
```csharp
public static ForgeTypeId TypeWallClosure { get; }
```